---
kind: property
id: P:Autodesk.Revit.DB.KeyBasedTreeEntry.ParentKey
source: html/6fa8dcd2-5fc4-5ec2-033a-a9dd09e5ff99.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntry.ParentKey Property

The parent key of this entry.

## Syntax (C#)
```csharp
public string ParentKey { get; }
```

## Remarks
This value will be the empty string if this entry does not have a parent.